KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтчетыРезультатИспытаний/КАНАТ_ОтчетыРезультатИспытаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ОтчетыРезультатИспытаний</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Enums/КАНАТКач_ПараметрыОтчетов/КАНАТКач_ПараметрыОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КАНАТКач_ПараметрыОтчетов</name>
  <enumValues>
    <name>ВиткиНа1м</name>
  </enumValues>
  <enumValues>
    <name>ВысотаПлетения</name>
  </enumValues>
  <enumValues>
    <name>Диаметр</name>
  </enumValues>
  <enumValues>
    <name>ДлинаКаната</name>
  </enumValues>
  <enumValues>
    <name>ДлинаПетли</name>
  </enumValues>
  <enumValues>
    <name>КВПоРазрывнойНагрузке</name>
  </enumValues>
  <enumValues>
    <name>КВПоШагуЯчеи</name>
  </enumValues>
  <enumValues>
    <name>КоличествоРывковДоРазрыва1</name>
  </enumValues>
  <enumValues>
    <name>КоличествоРывковДоРазрыва177</name>
  </enumValues>
  <enumValues>
    <name>КоэфУзлования</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCd</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCk</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCp</name>
  </enumValues>
  <enumValues>
    <name>КоэффициентВариацииCt</name>
  </enumValues>
  <enumValues>
    <name>ЛинейнаяПлотность</name>
  </enumValues>
  <enumValues>
    <name>МаксимальнаяСилаРывка03</name>
  </enumValues>
  <enumValues>
    <name>МаксимальнаяСилаРывка177</name>
  </enumValues>
  <enumValues>
    <name>Масса1м</name>
  </enumValues>
  <enumValues>
    <name>МассаОплетки</name>
  </enumValues>
  <enumValues>
    <name>МассаПетли</name>
  </enumValues>
  <enumValues>
    <name>МассаСердечника</name>
  </enumValues>
  <enumValues>
    <name>МассаСтропа</name>
  </enumValues>
  <enumValues>
    <name>НадежностьКрепленияКанатаL1</name>
  </enumValues>
  <enumValues>
    <name>НадежностьКрепленияКанатаL2</name>
  </enumValues>
  <enumValues>
    <name>НомЛинПлотностьНити</name>
  </enumValues>
  <enumValues>
    <name>ОтносительноеУдлинениеПриНагрузке</name>
  </enumValues>
  <enumValues>
    <name>ОтносительноеУдлинениеПриНагрузкеСГС</name>
  </enumValues>
  <enumValues>
    <name>ПодъемнаяПотопляющаяСила</name>
  </enumValues>
  <enumValues>
    <name>РабочаяДлинаСтропа</name>
  </enumValues>
  <enumValues>
    <name>РазрывнаяНагрузка</name>
  </enumValues>
  <enumValues>
    <name>РасходНиткиНаУзел</name>
  </enumValues>
  <enumValues>
    <name>СдвигОплетки</name>
  </enumValues>
  <enumValues>
    <name>УдельнаяРазрывнаяНагрузка</name>
  </enumValues>
  <enumValues>
    <name>Удлинение75</name>
  </enumValues>
  <enumValues>
    <name>УдлинениеПодНагрузкой50150</name>
  </enumValues>
  <enumValues>
    <name>УдлинениеПодНагрузкой80</name>
  </enumValues>
  <enumValues>
    <name>УдлинениеПриРазрыве</name>
  </enumValues>
  <enumValues>
    <name>Усадка</name>
  </enumValues>
  <enumValues>
    <name>УсадкаТехнологическая</name>
  </enumValues>
  <enumValues>
    <name>УстойчивостьВеревкиСУзлом8</name>
  </enumValues>
  <enumValues>
    <name>ФабричныйРазмерЯчеи</name>
  </enumValues>
  <enumValues>
    <name>ФактЛинПлотностьНитиMinMax</name>
  </enumValues>
  <enumValues>
    <name>ФактЛинПлотностьНитиСР</name>
  </enumValues>
  <enumValues>
    <name>ЧислоВитковНа1м</name>
  </enumValues>
  <enumValues>
    <name>МаксимальнаяСилаРывка178</name>
  </enumValues>
</mdclass:Enum>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтчетыРезультатИспытаний/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовФормы();
	
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	Заголовок = Параметры.Синоним;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДок = ПечатьНаСервере();
	//++Бит Трейгер П.М. 25.10.2024 Блок Качества. Переделка.
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСлева = 10;
	ТабДок.ПолеСправа = 5;
	//--Бит Трейгер П.М. 25.10.2024 Блок Качества. Переделка.
	
	Идентификатор = Параметры.НазваниеОтчета;
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(Идентификатор);
	
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
	КоллекцияПечатныхФорм[0].Экземпляров = 1;
	КоллекцияПечатныхФорм[0].СинонимМакета = Параметры.Синоним;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.КАНАТ_ОтчетыРезультатИспытаний.ПФ_MXL_" + Параметры.НазваниеОтчета);
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ПараметрыШапка = Новый Структура;
	ПараметрыШапка.Вставить("Дата", Период);
	ПараметрыШапка.Вставить("Цех",  Цех);
	ОбластьШапка.Параметры.Заполнить(ПараметрыШапка);
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьТаблицаШапка = Макет.ПолучитьОбласть("ОбластьТаблицаШапка");
	ТабДок.Вывести(ОбластьТаблицаШапка);
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Период", Период);
	СтруктураПараметры.Вставить("Цех", Цех);
	
	ВыборкаЦех = Обработки.КАНАТ_ОтчетыРезультатИспытаний.ДанныеДляОтчета(СтруктураПараметры, Параметры.НазваниеОтчета);
	
	МассивВыводитьЦех = Новый Массив;
	МассивВыводитьЦех.Добавить("ОтчетПоИспытаниямГотовойПродукцииСДатой");
	
	МассивВыводитьДатуОтдельно = Новый Массив;
	МассивВыводитьДатуОтдельно.Добавить("ОтчетПоИспытаниямГотовойПродукцииСДатой");
	МассивВыводитьДатуОтдельно.Добавить("ОтчетНитиSisolСДатами");
	
	Пока ВыборкаЦех.Следующий() Цикл
		
		Если МассивВыводитьЦех.Найти(Параметры.НазваниеОтчета) <> Неопределено Тогда
			
			ОбластьТаблицаЦех = Макет.ПолучитьОбласть("ОбластьТаблицаЦех");
			ОбластьТаблицаЦех.Параметры.Цех = ВыборкаЦех.Цех;
			ТабДок.Вывести(ОбластьТаблицаЦех);
			
		КонецЕсли;
		
		ВыборкаДата = ВыборкаЦех.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДата.Следующий() Цикл
			
			ДатаВыведена = Ложь;
			ВыборкаДокумент = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДокумент.Следующий() Цикл
				
				ОбластьТаблицаСтрока = Макет.ПолучитьОбласть("ОбластьТаблицаСтрока");
				ОбластьТаблицаСтрока.Параметры.Заполнить(ВыборкаДокумент);
				
				Если МассивВыводитьДатуОтдельно.Найти(Параметры.НазваниеОтчета) <> Неопределено Тогда
					Если Не ДатаВыведена Тогда
						
						ДатаВыведена = Истина;
						
					Иначе
						
						ОбластьТаблицаСтрока.Параметры.Дата = Неопределено;
						
					КонецЕсли;
				КонецЕсли;
				
				ВыборкаДетальныеЗаписи = ВыборкаДокумент.Выбрать();
				
				СтруктураЗначений = Новый Структура;
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПараметрОтчетов) Тогда
						
						//ОбластьТаблицаСтрока.Параметры[ПолучитьИмяПеречисления(ВыборкаДетальныеЗаписи.ПараметрОтчетов)] = ВыборкаДетальныеЗаписи.Факт;
						
						Если ВыборкаДетальныеЗаписи.ПараметрОтчетов = Перечисления.КАНАТКач_ПараметрыОтчетов.ЛинейнаяПлотность Тогда
							
							Если СтрНайти(НРег(ВыборкаДетальныеЗаписи.ЕдИзм.Наименование), "ктекс") <> 0 Тогда
								
								Если Не СтруктураЗначений.Свойство("ЛинейнаяПлотность_ктекс") Тогда
									
									СтруктураЗначений.Вставить("ЛинейнаяПлотность_ктекс", ВыборкаДетальныеЗаписи.Факт);
									
								Иначе
									
									СтруктураЗначений.ЛинейнаяПлотность_ктекс = СтрШаблон("%1 / %2",
																						  СтруктураЗначений.ЛинейнаяПлотность_ктекс,
																						  ВыборкаДетальныеЗаписи.Факт);
									
								КонецЕсли;
								
							ИначеЕсли СтрНайти(НРег(ВыборкаДетальныеЗаписи.ЕдИзм.Наименование), "текс") <> 0 Тогда
								
								Если Не СтруктураЗначений.Свойство("ЛинейнаяПлотность_текс") Тогда
									
									СтруктураЗначений.Вставить("ЛинейнаяПлотность_текс", ВыборкаДетальныеЗаписи.Факт);
									
								Иначе
									
									СтруктураЗначений.ЛинейнаяПлотность_текс = СтрШаблон("%1 / %2",
																						  СтруктураЗначений.ЛинейнаяПлотность_текс,
																						  ВыборкаДетальныеЗаписи.Факт);
									
								КонецЕсли;
								
							КонецЕсли;
							
						ИначеЕсли ВыборкаДетальныеЗаписи.ПараметрОтчетов = Перечисления.КАНАТКач_ПараметрыОтчетов.РазрывнаяНагрузка Тогда
							
							Если СтрНайти(НРег(ВыборкаДетальныеЗаписи.ЕдИзм.Наименование), "дан") <> 0 Тогда
								
								Если Не СтруктураЗначений.Свойство("РазрывнаяНагрузка_дан") Тогда
									
									СтруктураЗначений.Вставить("РазрывнаяНагрузка_дан", ВыборкаДетальныеЗаписи.Факт);
									
								Иначе
									
									СтруктураЗначений.РазрывнаяНагрузка_дан = СтрШаблон("%1 / %2",
																						  СтруктураЗначений.РазрывнаяНагрузка_дан,
																						  ВыборкаДетальныеЗаписи.Факт);
									
								КонецЕсли;
								
							ИначеЕсли СтрНайти(НРег(ВыборкаДетальныеЗаписи.ЕдИзм.Наименование), "кгс") <> 0 Тогда
								
								Если Не СтруктураЗначений.Свойство("РазрывнаяНагрузка_кгс") Тогда
									
									СтруктураЗначений.Вставить("РазрывнаяНагрузка_кгс", ВыборкаДетальныеЗаписи.Факт);
									
								Иначе
									
									СтруктураЗначений.РазрывнаяНагрузка_кгс = СтрШаблон("%1 / %2",
																						  СтруктураЗначений.РазрывнаяНагрузка_кгс,
																						  ВыборкаДетальныеЗаписи.Факт);
									
								КонецЕсли;
								
							КонецЕсли;
							
							Если Не СтруктураЗначений.Свойство("РазрывнаяНагрузка") Тогда
									
								СтруктураЗначений.Вставить("РазрывнаяНагрузка", СтрШаблон("%1 %2%3",
																						  ВыборкаДетальныеЗаписи.Факт,
																						  ВыборкаДетальныеЗаписи.ЕдИзм,
																						  Символы.ПС));
								
							Иначе
								
								СтруктураЗначений.РазрывнаяНагрузка = СтрШаблон("%1 %2 %3%4",
																				СтруктураЗначений.РазрывнаяНагрузка,
																				ВыборкаДетальныеЗаписи.Факт,
																				ВыборкаДетальныеЗаписи.ЕдИзм,
																				Символы.ПС);
								
							КонецЕсли;
							
						Иначе
							
							ИмяПараметра = ПолучитьИмяПеречисления(ВыборкаДетальныеЗаписи.ПараметрОтчетов);
							
							Если Не СтруктураЗначений.Свойство(ИмяПараметра) Тогда
									
								СтруктураЗначений.Вставить(ИмяПараметра, ВыборкаДетальныеЗаписи.Факт);
								
							Иначе
								
								СтруктураЗначений[ИмяПараметра] = СтрШаблон("%1 / %2",
																				СтруктураЗначений[ИмяПараметра],
																				ВыборкаДетальныеЗаписи.Факт);
								
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;
				
				СтруктураЗначений.Вставить("ЛинейнаяПлотность", "");
				Если СтруктураЗначений.Свойство("ЛинейнаяПлотность_ктекс") Тогда
					СтруктураЗначений.ЛинейнаяПлотность = СтрШаблон("%1%2 ",
																	СтруктураЗначений.ЛинейнаяПлотность,
																	СтруктураЗначений.ЛинейнаяПлотность_ктекс);
				КонецЕсли;
				Если СтруктураЗначений.Свойство("ЛинейнаяПлотность_текс") Тогда
					СтруктураЗначений.ЛинейнаяПлотность = СтрШаблон("%1(%2) ",
																	СтруктураЗначений.ЛинейнаяПлотность,
																	СтруктураЗначений.ЛинейнаяПлотность_текс);
				КонецЕсли;
				
				СтруктураЗначений.Вставить("РазрывнаяНагрузкаДАНКГС", "");
				Если СтруктураЗначений.Свойство("РазрывнаяНагрузка_дан") Тогда
					СтруктураЗначений.РазрывнаяНагрузкаДАНКГС = СтрШаблон("%1%2 ",
																	СтруктураЗначений.РазрывнаяНагрузкаДАНКГС,
																	СтруктураЗначений.РазрывнаяНагрузка_дан);
				КонецЕсли;
				Если СтруктураЗначений.Свойство("РазрывнаяНагрузка_кгс") Тогда
					СтруктураЗначений.РазрывнаяНагрузкаДАНКГС = СтрШаблон("%1(%2) ",
																	СтруктураЗначений.РазрывнаяНагрузкаДАНКГС,
																	СтруктураЗначений.РазрывнаяНагрузка_кгс);
				КонецЕсли;
				
				ОбластьТаблицаСтрока.Параметры.Заполнить(СтруктураЗначений);
				
				ТабДок.Вывести(ОбластьТаблицаСтрока);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяПеречисления(Знач ПеречислениеСсылка)
	ИмяМетаданных = ПеречислениеСсылка.Метаданные().Имя;
	НазваниеМенеджера = "ПеречислениеМенеджер." + ИмяМетаданных;
	Менеджер = Новый (НазваниеМенеджера); 
	Имя = ПеречислениеСсылка.Метаданные().ЗначенияПеречисления[Менеджер.Индекс(ПеречислениеСсылка)].Имя;
	Возврат Имя;  
КонецФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	Если Параметры.НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииОбщий" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Ложь;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииЦех" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Истина;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетКанатыДляЛазания" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость      = Ложь;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетПетлиСтраховочныеАрамидные" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Ложь;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетСтропы" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Ложь;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетПолуфабрикаты" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Ложь;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетНитиSisol" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Истина;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетПоИспытаниямГотовойПродукцииСДатой" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Ложь;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетНитиSisolСДатами" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Истина;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетСетематериалы" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Ложь;
		
	ИначеЕсли Параметры.НазваниеОтчета = "ОтчетВеревкиСтраховочноСпасательные" Тогда
		
		Элементы.Период.Видимость = Истина;
		Элементы.Цех.Видимость    = Ложь;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОсновныеЕдИзмеренияДляПоказателей()
	
	Результат = Новый Структура;
	
КонецФункции
